Repository: OSGeo-jp/OSGeoLive-doc-omegat
Catalog: tm/quickstart--gmt_quickstart.tmx
Source language: en
Languages: ja

source: GMT Quickstart
ja: GMTクイックスタート

source: GMT is a collection of tools that allow users to manipulate (x,y) and (x,y,z) data sets (including filtering, trend fitting, gridding, projecting, etc.) and produce Encapsulated PostScript File (EPS) illustrations ranging from simple x-y plots through contour maps to artificially illuminated surfaces and 3-D perspective views in black and white, gray tone, hachure patterns, and 24-bit color.
ja: GMTは、(x,y)および(x,y,z)のデータセット(フィルタリング、トレンドフィッティング、グリッド、投影など)を操作して、Encapsulated PostScript File(EPS)イラストレーションを生成するためのツール群です。EPSイラストレーションには、単純なx-yプロットから等高線マップ、人工的に照らされたサーフェス、白黒、グレートーン、アッシャパターン、24ビットカラーの3Dパースビューまでがあります。

source: In this quick GMT tutorial we will use a digital terrain model (DTM) to generate a shaded relief map.
ja: このクイックGMTチュートリアルでは、デジタル地形モデル(DTM)を使用して、シェーディングされた防災地図を生成します。

source: Create a map
ja: マップを作成する

source: As our input dataset we will use a DTM from the GRASS GIS example dataset, which is accessible by GDAL using the GDAL-GRASS driver.
ja: 入力データセットとして、GRASS GISサンプルデータセットからのDTMを使用します。これは、GDAL-GRASSドライバを使用してGDALからアクセス可能です。

source: From a quick look at the DTM metadata, open a terminal and use the GDAL command `gdalinfo`:
ja: DTMメタデータをざっと見て、端末を開き、GDALコマンド`gdalinfo`:

source: We can see the DTM is in a projected coordinate system and the data range is between 50 and 160 meters.
ja: DTMが投影された座標系にあり、データ範囲が50～160メートルであることがわかります。

source: We can convert the DTM in a GMT Compatible netCDF file format with `gdal_translate` as follow:
ja: `gdal_translate`を使用して、GMT互換のnetCDFファイル形式のDTMを次のように変換できます。

source: For our GMT example we will first transform the dataset into geographic coordinates Longitude-Latitude (EPSG:4326) using the `gdalwarp` command:
ja: GMTの例では、最初に`gdalwarp`コマンドを使用して、データセットを地理座標(経度-緯度)(EPSG:4326)に変換します。

source: Make a color palette
ja: カラーパレットを作成

source: To assign a color map to our grid we can make a GMT color palette tables with the `makecpt` command. We will set the range and number of colors with the flag `-T` and assign a colormap with the flag `-C`.
ja: グリッドにカラーマップを割り当てるには、`makecpt`コマンドを使用してGMTカラーパレットテーブルを作成します。`-T`フラグで色の範囲と数を設定し、`-C`フラグでカラーマップを割り当てます。

source: You can experiment with other colortables, see `man gmt makecpt` for a complete list.
ja: 他のcolortablesを試してみることもできます。完全なリストについては、`man gmt makecpt`を参照してください。

source: Define the gradient
ja: グラデーションを定義

source: For our shaded relief example we need to specify show how the color intensity is distributed along the grid. To do so, we will compute the directional derivative, or gradient, from our grid using the `grdgradient` command. In `grdgradient` we will use the `-Ne` flag to normalize the output using a cumulative Laplace distribution and the `-A` flag for Azimuthal direction for a directional derivative.
ja: シェーディングされた防災地図の例では、カラー強度がグリッドに沿ってどのように分布しているかを表示するように指定する必要があります。そのために、「grdgradient」コマンドを使用して、グリッドから方向の導関数、つまり勾配を計算します。「grdgradient」では、「-Ne」フラグを使用して、累積ラプラス分布を使用して出力を正規化し、「-A」フラグを方位角方向の方向微分に使用します。

source: The output is a netCDF file which can then be used as color intensity by the `grdimage` command as follow:
ja: 出力はnetCDFファイルで、次のように`grdimage`コマンドでカラー強度として使用できます。

source: Display the color bar
ja: カラーバーを表示

source: Finally we can add a colorbar with `psscale`:
ja: 最後に、`psscale`を使ってカラーバーを追加します:

source: Here the flag `-D` is used to select the colorbar position `TC: Top Center`, the size `5x0.25` expressed in inches `i` the orientation by `h: horizontal` and the flag `-By` to set a label `m` on the `y axis`.
ja: ここでは、フラグ`-D`を使用して、カラーバーの位置`TC:Top Center`、サイズ`5x0.25`をインチ`i`で表したもの、方向を`h:horizontal`で表したもの、フラグ`-By`を使用してラベル`m`を`y軸`に設定したものを選択します。

source: The output ps document should look like:
ja: 出力されるps文書は次のようになります:

source: Things to try
ja: 試してみること

source: Look at some of the examples found in: `/usr/share/doc/gmt/examples <../../gmt/examples/>`_
ja: 次の例を見てください。`/usr/share/doc/gmt/examples<././gmt/examples/>`_

source: Go through the GMT tutorial and follow the several examples available in the src code. There are 30 example jobs built in, to test:
ja: GMTチュートリアルを実行し、srcコードで利用可能ないくつかの例に従ってください。30のサンプルジョブが組み込まれています。テストするには:

source: Open a terminal, then
ja: 端末を開き、次に

source: To view the results in Ghostview (http://www.gnu.org/software/gv/) , use command `gv`. Type `q` to quit Ghostview.
ja: 結果をGhostview(http://www.gnu.org/software/gv/))で表示するには、コマンド`gv`を使用します。`q`と入力してGhostviewを終了します。

source: What next?
ja: 次のステップ

source: Have a read of the local documentation stored in: `/usr/share/doc/gmt/html/ <../../gmt/html/index.html>`_
ja: `/usr/share/doc/gmt/html/<././gmt/html/index.html>`_に保存されているローカルのドキュメントを読んでください。

source: Website: https://gmt.soest.hawaii.edu
ja: Webサイト: https://gmt.soest.hawaii.edu

source: Support: https://gmt.soest.hawaii.edu/projects/gmt/boards/1
ja: サポート: https://gmt.soest.hawaii.edu/projects/gmt/boards/1
